{
  "qa": [
    {"q":"What is RPA?",                       "a":"Robotic process automation (RPA), also known as software robotics, uses intelligent automation technologies to perform repetitive office tasks of human workers."},
    {"q":"What is the lifecycle of RPA?",      "a":"RPA Lifecycle does not have any particular defined structure. It includes different phases of the automation process, from the creation of bots to the execution of the bots. Check out the following diagram displaying all these phases:<br>1) Discovery Phase<br>2) Solution Design Phase<br>3) Development Phase<br>4) User Acceptance Tests<br>5) Deployment and Maintenance Phase<br>6) Execute Bots"}, 
    {"q":"How does RPA work?",                 "a":"According to Forrester, RPA software tools must include the following core capabilities: <br>1) Low-code capabilities to build automation scripts.<br>2) Integration with enterprise applications.<br>3) Orchestration and administration including configuration, monitoring and security."},
    {"q":"What are the benefits of RPA?",      "a":"There are multiple benefits of RPA, including: Less coding, Rapid cost savings,  Higher customer satisfaction, Improved employee morale, Better accuracy and compliance, Existing systems remain in place, etc."},
    {"q":"What are the challenges of RPA?",    "a":"While RPA software can help an enterprise grow, there are some obstacles, such as organizational culture, technical issues and scaling.<br>1) Organizational culture : While RPA will reduce the need for certain job roles, it will also drive growth in new roles to tackle more complex tasks, enabling employees to focus on higher-level strategy and creative problem-solving. Organizations will need to promote a culture of learning and innovation as responsibilities within job roles shift. The adaptability of a workforce will be important for successful outcomes in automation and digital transformation projects. By educating your staff and investing in training programs, you can prepare teams for ongoing shifts in priorities.<br><br>2) Difficulty in scaling : While RPA can perform multiple simultaneous operations, it can prove difficult to scale in an enterprise due to regulatory updates or internal changes. According to a Forrester report, 52% of customers claim they struggle with scaling their RPA program. A company must have 100 or more active working robots to qualify as an advanced program, but few RPA initiatives progress beyond the first 10 bots."}, 
    {"q":"What are the use cases of RPA?",     "a":"There are several industries that leverage RPA technology to streamline their business operations. RPA implementations can be found across the following industries:<br>1) Banking and financial services<br>2) Supply chain<br>3) Telecom<br>4) Insurance<br>5) Retail<br>6) Healthcare"},
    {"q":"How does RPA operate?",              "a":"The robot uses keyboard and mouse controls to take actions and execute automations. Normally all of these actions take place in a virtual environment and not on screen. The robot does not need a physical screen to operate, rather it interprets the screen display electronically."},
    {"q":"How RPA is affecting employment?",   "a":"According to Harvard Business Review, most operations groups adopting RPA have promised their employees that automation would not result in layoffs. Instead, workers have been redeployed to do more interesting work. One academic study highlighted that knowledge workers did not feel threatened by automation: they embraced it and viewed the robots as team-mates."},
    {"q":"What is unassisted RPA?",            "a":"Unassisted RPA, or RPAAI, is the next generation of RPA related technologies. Technological advancements around artificial intelligence allow a process to be run on a computer without needing input from a user."},
    {"q":"What is Hyperautomation?",           "a":"Hyperautomation is the application of advanced technologies like RPA, artificial intelligence, machine learning (ML) and process mining to augment workers and automate processes in ways that are significantly more impactful than traditional automation capabilities."}, 
    {"q":"What are the applications of RPA?",  "a":"Quote-to-cash, Procure-to-play, Customer onboarding, Employee onboarding, Data migration and data entry, Data validation, Periodic report preparation, Generating mass emails, Creating and developing invoices, Proce comparison, etc."},
    {"q":"What are the components of RPA?",    "a":"The core components of Robotic Process Automation are listed below:<br>1) Recorder<br>2) Development Studio<br>3) Plugin or Extension<br>4) Bot Runner<br>5) Control center"},
    {"q":"What are the pros of RPA?",          "a":"Some of the significant advantages of Robotic Process Automation software are given below:<br>1) Code Free<br>2) Non Disruptive<br>3) User Friendly<br>4) Rich Analytical Suite<br>5) Security<br>6) Rule based Exception Handling<br>7) Hosting and Deployment Options<br>8) Actionable Intelligence<br>9) Debugging"},
    {"q":"What are the cons of RPA?",          "a":"Some of the major drawbacks of Robotic Process Automation software are given below:<br>1) Potential Job Losses<br>2) Initial Investment Costs<br>3) Hiring Skilled Staff<br>4) Employee Resistance<br>5) Process Selection"}
  ]  
}